[
{
  "source": "g2",
  "company_name": "NetSuite",
  "title": "4.5/5What do you like best about NetSuite?I have been using Netsuite for past 3 ...",
  "review_text": "4.5/5What do you like best about NetSuite?I have been using Netsuite for past 3 years. Netsuite is one of the best accounting software i have used. It is easy to use and come with lots of features, security. As i use this software on daily basis. Its easy to integrate this with other software's. Implementation process is also smooth and quick, Implementation team is well knowledgeable and problem solver. I reached out to customer support multiple times for some issues and they are easily approachable. With the help of this software Accounting is smooth its also helping us in other framework. Review collected by and hosted on G2.com.What do you dislike about NetSuite?I like this product but there are some issues which i faced during my usage. As a user I have to post multiple transfer entries from one bank account to other. so I cant do this via upload csv for this i have to do multiple manual entries. Review collected by and hosted on G2.com.What problems is NetSuite solving and how is that benefiting you?Netsuite is mainly helping us in Accounting. It helps us in monitoring Inventory accurately and recording accounts payable via PO. This is very helpful and make our work easy. With the help of this we can easily monitor inventory, In this way it is helping us. As we have multiple transaction with the help of import facility we imported those transactions and easily record the same. Review collected by and hosted on G2.com. Show More",
  "date": "2025-06-26",
  "rating": 4.5,
  "reviewer_name": "Pankaj P.",
  "scraped_at": "2025-09-13T20:59:53.256130"
},
{
  "source": "g2",
  "company_name": "NetSuite",
  "title": "3.5/5What do you like best about NetSuite?The ability to customize just about an...",
  "review_text": "3.5/5What do you like best about NetSuite?The ability to customize just about anything I do in the app. I can write Suitescript to perform a whole host of actions, including sending webhooks and communicating with other systems, create custom fields, custom formulas, build workflows with a no-code UI, etc. It is also quite comprehensive, performing anything from rev rec and billing to invoicing and subscription management Review collected by and hosted on G2.com.What do you dislike about NetSuite?Netsuite is not incredibly user-friendly. And when you want to do something complex, there are many times where the built-in workflow functionality just isn't enough. At that point you either need to pay a consultancy or use engineering resources to get things done. The cost is also substantial, though admittedly not much more expensive than even a newer, shinier service like Stripe for things like subscription management & billing. Review collected by and hosted on G2.com.What problems is NetSuite solving and how is that benefiting you?Netsuite takes care of AR/AP for us quite straightforwardly. It also is a source of record for all customer invoicing and transactions, though it doesn't serve as a billing portal. We use it to do subscription management & billing for higher-revenue customers which it does a fine job of. Review collected by and hosted on G2.com. Show More",
  "date": "2025-06-26",
  "rating": 3.5,
  "reviewer_name": "Andy M.",
  "scraped_at": "2025-09-13T20:59:56.592044"
},
{
  "source": "g2",
  "company_name": "NetSuite",
  "title": "4/5What do you like best about NetSuite?It is has quite complex UI and has hard ...",
  "review_text": "4/5What do you like best about NetSuite?It is has quite complex UI and has hard learning curve because of the various features it provides which makes it powerful but not easy to use. It has robust integration support and can be integrated with most of plateform we have integrated it with MuleSoft but the integration process is little complex. It has well implemented import and export options for batch data. It provides the centralized dashboard which makes it easy to manage and moniter operation for high frequency of use. Review collected by and hosted on G2.com.What do you dislike about NetSuite?Its implementation is costly and reliant on external consultant. It native analysis tool is good but for complex and better reports we have to use third party tools. Its support for refreshing sandbox for testing is often slow and customer support can involve long wait. Review collected by and hosted on G2.com.What problems is NetSuite solving and how is that benefiting you?It helped us in optimising inventory across locations with local compliance which benifits our global operation. It boosts our efficiency as we automated our cor workflows like procure to pay and order to cash. It also provides us faster and accurate visibility with its realtime data on dashboard. Review collected by and hosted on G2.com. Show More",
  "date": "2025-06-16",
  "rating": 4.0,
  "reviewer_name": "Samala P.",
  "scraped_at": "2025-09-13T20:59:56.592442"
},
{
  "source": "g2",
  "company_name": "NetSuite",
  "title": "3.5/5What do you like best about NetSuite?What I like most about the Netsuite ER...",
  "review_text": "3.5/5What do you like best about NetSuite?What I like most about the Netsuite ERP is that linking and navigating between linked transactions like sales orders, invoices, payments, customer record, revenue arrangement, etc. makes it easy to move around the system. Review collected by and hosted on G2.com.What do you dislike about NetSuite?I would want to see the ease of adjusting reports to be improved. When trying to add fields to a report it is very difficult to locate the related field we want because names repeat, are not showing, or even naming conventions change. Review collected by and hosted on G2.com.What problems is NetSuite solving and how is that benefiting you?Netsuite helped with the automation of sending out emails to customers after automatically generating the invoice. This saves time. However if something went wrong in the creation of the billing schedule or the configuration of the Avalara integration now a credit memo for that invoice has to be created and customer already got emailed an incorrect invoice and the sales order even after credit memo may show a status of fully billed and this can further make the revenue arrangement not show properly. Review collected by and hosted on G2.com. Show More",
  "date": "2025-06-05",
  "rating": 3.5,
  "reviewer_name": "Benjamin S.",
  "scraped_at": "2025-09-13T21:00:03.701938"
},
{
  "source": "g2",
  "company_name": "NetSuite",
  "title": "5/5What do you like best about NetSuite?I have been working with NetSuite for ov...",
  "review_text": "5/5What do you like best about NetSuite?I have been working with NetSuite for over 11 years. I enjoy that they seem to be updating the product and features continuously. Sometimes this creates a few hiccups, but overall they seem very prepared to take their customers with them as they modernize. I enjoy the ability to control so many aspects of my accounting system and the depths of their reporting capacity. The representatives we've worked with over the years have always been incredibly responsive so I believe you get what you pay for with this product. We use it every day and across office locations with ease. I was not there when we implemented NetSuite, but from what I know it was very easy. We have integrated several features on the years and it was always fairly seamless. Review collected by and hosted on G2.com.What do you dislike about NetSuite?As I mentioned about updates, sometimes it can cause minor disruptions and it can happen quickly. When they deprecated 1099s that was a little stressful because we found out right before year end. However, in the end it was worth it because the program we got was even better. Just painful in the transition period. Also, there are some areas where I think the reporting and processes were built by IT professionals and not accountants. I'm sure they're tired of hearing that, since us accountants can appear to be giant complainers. The reporting is so complex that sometimes it's hard to know what format to start with when you want to do something. Also, we ran into an issue where two features combined do not give us the result promised (income statement with all active accounts, including zero balances but not inactive accounts). We have been through their service desk and no one seems to understand why it doesn't produce that right information and keeps including inactive accounts in the final report. Lastly, support is incredibly helpful but be prepared to deal with time zone issues and potentially timing issues. Review collected by and hosted on G2.com.What problems is NetSuite solving and how is that benefiting you?NetSuite is managing almost all of our accounting functions. It provides a lot of scheduled reporting and houses all of our financials, for internal reporting and external reporting. Review collected by and hosted on G2.com. Show More",
  "date": "2025-06-05",
  "rating": 5.0,
  "reviewer_name": "Baylee V.",
  "scraped_at": "2025-09-13T21:00:03.702407"
}
]