[
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Terrible customer service. They make it very easy to accidently upgrade to expen...",
  "review_text": "Terrible customer service. They make it very easy to accidently upgrade to expensive business plan with single misclick which charges your card immediately. Customer service is then very slow to respond and incompetent and refuse to give back full refund.Would be a good platform if customer service was not terrible",
  "date": "2024-10-09",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:41.328732"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Free version AMAZING. Life changing.",
  "review_text": "Free version AMAZING. Life changing.",
  "date": "2024-10-07",
  "rating": 5.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:41.331503"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Hard to see why this is better than alternatives for notes and connections betwe...",
  "review_text": "Hard to see why this is better than alternatives for notes and connections between notes. Would rather use something cleaner and more straightforward like Apple Notes / Google Docs / Obsidian at most for all the interconnected notes.",
  "date": "2024-10-06",
  "rating": 3.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.598975"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "I started using notion around a few months ago. I use it for basic tracking of p...",
  "review_text": "I started using notion around a few months ago. I use it for basic tracking of projects and organising each of these projects.It has been thoroughly useful to have all this is one place, seamlessly cross platformed (android phone, iPad and Chromebook). I also contacted recently regarding the lack of pinch zoom ability on iPad app, not a deal breaker, but wondered if there was a bug. Customer service was 100% excellent. They replied with thoroughness and although the feature is not available they put in a vote for the feature to be added.notion has without a doubt helped me towards achieving my projects",
  "date": "2024-10-03",
  "rating": 5.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.602387"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "The product is amazing, but if you have a problem, customer service is one of th...",
  "review_text": "The product is amazing, but if you have a problem, customer service is one of the worst I've seen.",
  "date": "2024-10-03",
  "rating": 3.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.602831"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Recently, I’ve been trying to cancel my membership and switch to the free versio...",
  "review_text": "Recently, I’ve been trying to cancel my membership and switch to the free version since I no longer wanted to pay for the subscription. However, I’m unable to remove my card, and they’ve charged me through an automatic deduction. When I reached out via email to request a refund, they claimed they couldn’t process it because it’s been more than three days since the invoice. But it’s their fault for taking too long to respond, and I have the receipts and everything showing how long they took. Now I’m stuck in this situation, even though it’s not my mistake. Their customer service is terrible.If you want to see them or have a look at them I am open to showing it to you guys :)) screw notion",
  "date": "2024-09-29",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.603176"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "When I first subscribed to Notion, I realized that they were not honest with pri...",
  "review_text": "When I first subscribed to Notion, I realized that they were not honest with pricing. They were showing prices without taxes and suddenly I discovered extra charges for VAT. Almost one year later, when it was about to renew, I discovered that the plan I have cost much more!I searched more on the relevant section and I discovered other invoices issued later, whitout any warning.I finlaty understood , that I had mistakenly activated some extra memers, due to a very delicate distinction between memebrs and quests. When I activated those extra memebrs, I thought it was free. They did not notify me but they charged my card whithout any warning!Looking at internet discussion and forums, there many people that had the same experience!",
  "date": "2024-09-06",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.603522"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Accounts are blocked based on geographic location",
  "review_text": "Accounts are blocked based on geographic location",
  "date": "2024-09-06",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.603914"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "In my bank history, I saw a $80 charge for notion. On August 20, I wrote to noti...",
  "review_text": "In my bank history, I saw a $80 charge for notion. On August 20, I wrote to notion about the issue and asked them to cancel all subscriptions on my card. This time, on September 1, I received an invoice of around 120 dollars.They did not cancel my card and did not help me with my support. I couldn't avoid their scam until I canceled my credit card from my bank and changed the number. No customer satisfaction or proper communication, they just take as much money as they can. Never trust, you can find many similar and better applications.They caused me to lose more than $200 in total.",
  "date": "2024-09-01",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.604221"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "I made a mistake 3 years ago when I decided to buy a subscription and support th...",
  "review_text": "I made a mistake 3 years ago when I decided to buy a subscription and support the developers. Now I have been living in Europe for a long time and pay with a European card, but because I once paid with a Russian card, they will take away my recently paid subscription and all my data. Think about supporting them, because sooner or later it may come back to bite you.",
  "date": "2024-09-01",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.604522"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Notion decided to delete all accounts and data (!), including free ones, of Russ...",
  "review_text": "Notion decided to delete all accounts and data (!), including free ones, of Russian users due to “sanctions”, which, by the way, do not limit the distribution of free software.This perfectly characterizes the company and its management.Think well before using Notion, maybe next time they will stop liking your nationality.I'm switching to a local open-source alternative and will never touch Notion again, even when they come back with an apology.",
  "date": "2024-08-27",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.604819"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "They totally ripped us off!!! My partner accidentally added users when trying to...",
  "review_text": "They totally ripped us off!!! My partner accidentally added users when trying to share documents. They had no understanding so we had to pay 5 times the bill that we should have had for a whole year! No consideration from their customer service!",
  "date": "2024-08-24",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.605111"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "if you need to use it as task manager i dont recommend it. i created all my docs...",
  "review_text": "if you need to use it as task manager i dont recommend it. i created all my docs and created teamspace and then it said i need to upgrade to use further. i didnt use it a lot but compare to trello for task management it sucks.",
  "date": "2024-08-20",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.605434"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "They make it impossible to unsubscribe from their marketing emails. Have been tr...",
  "review_text": "They make it impossible to unsubscribe from their marketing emails. Have been trying for more than 3 weeks to get unsubscribe one of our ex-employees. Unsubscribe links do not work, customer support is helpless and useless.",
  "date": "2024-08-16",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.605726"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "not reliable, you may lost all your data and there is no help from support they ...",
  "review_text": "not reliable, you may lost all your data and there is no help from support they told me ask another person to invite you to the project and still it didnt help. I will never use online cloud based service for my notes . prefer to keep it local and safe .",
  "date": "2024-07-28",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.606016"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Disappointed! Extremely Disappointed!I changed companies recently and I noticed ...",
  "review_text": "Disappointed! Extremely Disappointed!I changed companies recently and I noticed that my notion was associated to my previous company email by mistake and I cannot change to the new one. I asked for support, I got a reply with the required information and I sent the information I could - 10 DAYS have passed and not a single word - nothing - not that we are working on it or the information is not valid please send something valid...but no reply at all...and I mentioned on the first email 13 days ago that it was urgent and still nothing. Stay away from them...I am being made hostage with my own information that I wrote in their app and I am desparate need and I don't any reply. Extremely disappointed service and I was a paid user...so it doesn't matter paid or free you will get treated like the bottom of the barrel and with no reply...at all! STAY AWAY.",
  "date": "2024-07-27",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.606327"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Enjoy using notion a lot for my daily work interface. Helps me set up my employe...",
  "review_text": "Enjoy using notion a lot for my daily work interface. Helps me set up my employees and gets them ready + assigned to tasks with no issue. It is limited on what you can do with the free plan, we upgraded to take care of that. I will continue to use the platform and update my review accordingly.",
  "date": "2024-07-26",
  "rating": 3.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.606616"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "I was willing to spend $10 for a monthly subscription to their inferior AI for t...",
  "review_text": "I was willing to spend $10 for a monthly subscription to their inferior AI for the sake of having it within Notion instead of continually going back and forth between Notion and ChatGPT. Unfortunately, their subscription pop-ip is super unclear and I accidentally purchased an annual subscription thinking I was being offered a discount on the monthly rate. You actually have to do the math to see that the monthly rate in the box that looks as though its just a discounted monthly rate matches the box with the annual rate when multiplied by 12. There's no other indicator that, by clicking, you're agreeing to pay $96 instead of $8. And no purchase confirmation screen - one errant mouse click and I was out $96 that I can't afford right now.On their website, Notion says that they have a 72-hour refund policy on accidental purchases in general and 30 days on purchases of any annual plan. But that requires the company to actually respond to customer service emails (which is the only way to reach them). I emailed them immediately, and it took a day for me to receive a boiler plate response (with an incorrect assessment of my situation saying that I wanted to downgrade from an annual to a monthly plan - I was so ticked at the confusing interface and lack of any systematized way of requesting a refund that I just wanted a refund), and also saying that my request was being escalated to their finance team, but that the finance team had a \"ticket backlog\" so I might not hear back for a day or so. (I can guess why there's a ticket backlog with how confusing the purchase process is). It's now been a full work week, and despite multiple follow ups there's been no response from this finance team. Yes, it's only been a week, but 1) $96 is a lot of money for some of us to be out for any amount of time when we didn't budget for it, 2) It's ridiculous that the matter of a simple refund needs to be \"escalated\" to a finance team at all - especially when they expound upon their \"no hassle\" refund policy on their own website. If they were actually trying to make it no hassle, they'd empower their customer service reps to issue refunds for anything that clearly falls within their stated policies. There's nothing to review here! I requested a refund within minutes of purchase, and their policy says I'll be issued a refund if requested within 30 days!, and 3) It's a joke that a cutting edge tech company who boasts about their AI capabilities requires human review for this at all! There should be a button on the billing page directly next to the charge where customer's can file a refund request. The data verification (which basically amounts to \"is the purchase date within 30 days of the refund request? Y/N\") should be instantaneous. One last thing. If you've got multiple work spaces on a single account, you should be aware that even if you did intend to pay $96 for their cruddy AI, it will only work within the workspace you're in when you purchase it. There's absolutely no disclaimer to this effect, and this is different from any other app I've used where you can partition your use cases (here it's work vs personal). I purchased this within my personal work space, which I hardly use, but would have to pay another $96 if I wanted to use it in my professional workspace. I'm now realizing that this is a larger infrastructure problem where it's impossible to tell which settings are applied to you're account, and which ones are specific to individual workspaces. I've already had mounting privacy concerns about using Notion (who's business model is basically to give away the main product and generate revenue from selling your private data), and this lack of concern for customers just tipped me over to deleting the app. I'm glad I never built it out as much as I wanted to. Buyer beware!",
  "date": "2024-07-13",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.607099"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Absolute cowboys. Notion \"gifted\" my company $1000 in credit to \"try notion out....",
  "review_text": "Absolute cowboys. Notion \"gifted\" my company $1000 in credit to \"try notion out.\" The small print was that the credit expired after a year. We didn't use Notion. The account was wholly unused and dormant. With zero warnings, Notion quietly started charging us month after month. It took us the best part of a year to realise. They refused to refund anything other than the most recent month. Snakes.",
  "date": "2024-07-12",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.607441"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "Don't subscribe to this. It is really useless, and you can't unsubscribe. If you...",
  "review_text": "Don't subscribe to this. It is really useless, and you can't unsubscribe. If you have a problem, don't try to solve it. There is no solution. The strategy is to drag out the issue until you're fed up. After 40 emails, I could not solve my simple problem. They automatically upgraded my account without asking me. When I wanted to fix their mistake, they asked me to pay for the days that I did not use the service. Unfortunately, they took the money and did not refund it. After 40 emails, I gave up and canceled my subscription.\"",
  "date": "2024-07-11",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.607930"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "My subscription period was coming to an end, I forgot to cancel it, and then wan...",
  "review_text": "My subscription period was coming to an end, I forgot to cancel it, and then wanted to do it in the settings, but it only allowed me to cancel my plan for the next year, not the current, I thought it was some kind of bug and did not have time to look into it further.I tried doing it multiple times, but it always worked only for the next billing period, and not for the current. Suddenly after some time my account was blocked and could be use only in the view mode. I email support, but it was not helpful at all.I see it as a misleading practice, they do not inform you enough about renewing your subscription, but when it happens, you cannot cancel it, and then they just block your account and keep charging you money.",
  "date": "2024-07-10",
  "rating": 1.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.608235"
},
{
  "source": "trustpilot",
  "company_name": "notion.so",
  "title": "I use this platform for many years every day. It's a great tool to manage you li...",
  "review_text": "I use this platform for many years every day. It's a great tool to manage you life and business.",
  "date": "2024-06-16",
  "rating": 5.0,
  "reviewer_name": null,
  "scraped_at": "2025-09-13T21:05:48.608519"
}
]